[{"model": "project.project", "pk": 1, "fields": {"image": "project/image/expense_tracker_vVaNrf9.png", "title": "Expense Tracker", "description": "Expense Tracker is a Django-based web app for group expense management and easy settlements. Simplify tracking, categorizing, and settling expenses with automated calculations and clear reports.", "link": "https://github.com/Parth971/Expense-Tracker-Django-Website"}}, {"model": "project.project", "pk": 2, "fields": {"image": "project/image/news_website.png", "title": "News Website", "description": "News-Website is a powerful Django-based web application that integrates with Scrapy, allowing it to scrape news articles from various news websites. With this innovative combination, the application provides users with a seamless experience of accessing and reading news from multiple sources, all in one convenient platform.", "link": "https://github.com/Parth971/Django-News-website"}}, {"model": "project.project", "pk": 3, "fields": {"image": "project/image/github_scraper_-_scrapy.png", "title": "Github scraper - Scrapy", "description": "GitHub Scraper is a Scrapy-based web scraper that allows users to input any GitHub domain link. The scraper will automatically download all the repositories within that link as zip files. Simplify repository archiving and management with this efficient tool for offline access to GitHub projects.", "link": "https://github.com/Parth971/Github-Scrapper-Using-Scrapy"}}, {"model": "project.project", "pk": 4, "fields": {"image": "project/image/github_scraper_-_pure_selenium.png", "title": "Github scraper - Pure Selenium", "description": "GitHub Scraper - Pure Selenium is a web scraper that enables users to input any GitHub domain link. The scraper, built using Selenium, automatically downloads all the repositories within that link as zip files. Simplify repository archiving and management with this tool for offline access to GitHub projects.", "link": "https://github.com/Parth971/Github-Scraper-Pure-Selenium"}}, {"model": "project.project", "pk": 5, "fields": {"image": "project/image/pure_js_validations.jpg", "title": "Pure JS Validations", "description": "Pure JS Validations is a website project that features a form with comprehensive field validations. Developed without relying on jQuery or any third-party packages, the validations are implemented purely using JavaScript. The website ensures user input integrity and improves the overall user experience by providing real-time validation feedback without any external dependencies.", "link": "https://github.com/Parth971/Pure-Js-Validations"}}, {"model": "project.project", "pk": 6, "fields": {"image": "project/image/todo_and_calculator_-_javascript_project.jpg", "title": "Todo and Calculator - Javascript Project", "description": "Todo and Calculator is a JavaScript-based website project that includes a Todo app and a Calculator. The Todo app allows users to add, delete, and clear todos with titles and descriptions. The Calculator supports essential calculations like addition, subtraction, multiplication, division, and modulus, with proper JavaScript validations for accurate results. Enhance productivity and perform calculations seamlessly while managing your todos with this dual-functionality website.", "link": "https://github.com/Parth971/Todo-and-Calculator-JS"}}, {"model": "project.project", "pk": 7, "fields": {"image": "project/image/portfolio_website.png", "title": "Portfolio Website", "description": "Bootstrap 3.3 Portfolio Website is a project designed to create a professional and visually appealing portfolio website. The website is fully responsive, adapting seamlessly from large screens to mobile screens. With proper structured HTML and CSS, this project showcases your work and skills in an attractive and user-friendly manner.", "link": "https://github.com/Parth971/Portfolio-Bootstrap3.3"}}, {"model": "project.project", "pk": 8, "fields": {"image": "project/image/bootstrap_website_-_theme_naruto.png", "title": "Bootstrap Website - Theme Naruto", "description": "Bootstrap 3.3 Naruto Theme is a project that utilizes Bootstrap and CSS to create a website with a Naruto-inspired theme. The website is fully responsive, ensuring a seamless viewing experience across different devices and screen sizes. With proper structured HTML and CSS, this project combines the power of Bootstrap with the popular Naruto aesthetic to deliver an engaging and visually appealing website.", "link": "https://github.com/Parth971/Bootstrap-Website-Theme-Naruto"}}, {"model": "project.project", "pk": 9, "fields": {"image": "project/image/aws_lambda_function.png", "title": "AWS Lambda Function", "description": "AWS Lambda Function: A serverless function triggered by file uploads to an S3 bucket. It detects the latest file in the specified folder, copies it to a new location, and deletes it from the old folder. It then initiates two workflows using AWS Glue based on the file's CDMS suffix. Offers seamless automation and workflow integration for efficient data processing and management.", "link": "https://github.com/Parth971/Lambda-Function"}}, {"model": "project.project", "pk": 10, "fields": {"image": "project/image/images_to_word_document.png", "title": "Images to Word Document", "description": "Images-to-Docs: A Python script that generates a structured doc file containing images from different folders with the same filename. The script creates a table with corresponding folder names and images, allowing for easy organization and presentation of the images. Simply configure the script with the desired folder paths and run it to generate the doc file. Provides a convenient solution for collating and displaying images in a tabular format.", "link": "https://github.com/Parth971/Images-to-Docs"}}, {"model": "project.project", "pk": 11, "fields": {"image": "project/image/school_management_system.png", "title": "School Management System", "description": "School-Management-System: A Django-based website for efficient school management. Features include class, student, and teacher management with CRUD operations, session-based login/logout, and search/filter functionality. Simplify administrative tasks and streamline school operations with this comprehensive and user-friendly system.", "link": "https://github.com/Parth971/School-Management-System"}}, {"model": "project.project", "pk": 12, "fields": {"image": "project/image/parth_desai_-_website.jpg", "title": "Parth Desai - Website", "description": "Parth Desai - Website: A personalized platform created using the Django web framework. This website serves as a hub to advertise and sell services, display past projects, showcase skills, and provide access to a comprehensive CV. Explore the expertise of Parth Desai through this professionally designed and user-friendly website.", "link": "https://github.com/Parth971/Parth-Desai-Website"}}]